package zx.soft.sent.solr.demo;

import zx.soft.negative.sentiment.core.NegativeClassify;

public class NegativeClassifyDemo {

	public static void main(String[] args) {

		NegativeClassify negativeClassify = new NegativeClassify();
		String text = "综合消息,近日,湖南湘潭县妇幼保健院一产妇死亡,经媒体报道引发关注。据“央视新闻”消息,湘潭县卫生局称,胎儿出生后产妇出现呕吐呛咳,"
				+ "院方立即抢救,但产妇因羊水栓塞引发多器官功能衰竭,抢救无效死亡。目前湘潭县卫生局、司法局已介入调查。据此前媒体报道,10日上午11点,医生"
				+ "给张女士做了产前检查,胎位正常,由于胎儿较重,医生建议家属做剖腹产。随后,张女士被推进五楼的手术室。12点05分,手术室护士告诉家属,产妇顺"
				+ "利产下宝宝。半个小时后,护士通知守在手术室外的刘先生,称产妇出现大出血情况,刘先生说,1个小时后,护士又通知他,称出血情况没止住,要其赶紧"
				+ "去买止血药。下午5点左右,一名护士通知刘先生,称产妇大出血,现在必须切除子宫,需要签字。晚上9点,刘先生家人听到有人在议论,说产妇已经死了。"
				+ "情急之下的刘先生上前使劲拍打手术室的大门,这时,出来一个自称是代理院长的人,说产妇仍在抢救,有脉搏。刘先生只得在外继续焦急地等待。直到"
				+ "晚上11点,刘先生再也按捺不住,再次敲门,询问护士情况,可此时,手术室内没有任何人回答他,因为手术室的门被反锁,刘先生不得不撬开手术室的大门"
				+ "。可进去之后,刘先生看到的了让他难以置信的一幕:妻子赤身裸体躺在手术台上,满口鲜血,眼睛里还含着泪水,可却再也没有了呼吸。而本应该在抢救"
				+ "的医生和护士,却全体失踪了,房间里只有一些不明身份的男子在吃着槟榔,抽着烟。针对此事,湘潭县卫生局称,8月10日12点05分胎儿出生后,产妇出现"
				+ "呕吐呛咳,院方立即抢救,但产妇因羊水栓塞引发多器官功能衰竭,抢救无效于21点30分死亡。目前湘潭县卫生局、司法局已介入调查。";
		System.out.println(negativeClassify.getTextScore(text));
		negativeClassify.cleanup();

	}

}
